
# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
 
 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, conv_bn_hswish, [16, 2]]  # 0-P1/2
 
  - [-1, 1, MobileNetV3_InvertedResidual, [16, 16, 3, 2, 1, 0]]  # 1-p2/4
 
  - [-1, 1, MobileNetV3_InvertedResidual, [24, 72, 3, 2, 0, 0]]  # 2-p3/8
  - [-1, 1, MobileNetV3_InvertedResidual, [24, 88, 3, 1, 0, 0]]
 
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 96, 5, 2, 1, 1]]  # 4-p4/16
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [40, 240, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 120, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [48, 144, 5, 1, 1, 1]]
 
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 288, 5, 2, 1, 1]]  # 9-p5/32
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]
  - [-1, 1, MobileNetV3_InvertedResidual, [96, 576, 5, 1, 1, 1]]
  - [-1, 1, SPPELAN, [1024, 256]]  # 修12
 
 
# YOLOv8.0n head
head:
  - [ 4, 1, Conv, [ 256 ] ]  # 10-P3/8
  - [ 6, 1, Conv, [ 256 ] ]  # 11-P4/16
  - [ 9, 1, Conv, [ 256 ] ]  # 12-P5/32

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 13 P5->P4
  - [ [ -1, 11 ], 1, Bi_FPN, [ ] ] # 14
  - [ -1, 3, C2f, [ 256 ] ] # 15-P4/16

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 16 P4->P3
  - [ [ -1, 10 ], 1, Bi_FPN, [ ] ] # 17
  - [ -1, 3, C2f, [ 256 ] ] # 18-P3/8

  - [ 1, 1, Conv, [ 256, 3, 2 ] ] # 19 P2->P3
  - [ [ -1, 10, 20 ], 1, Bi_FPN, [ ] ] # 20
  - [ -1, 3, C2f, [ 256 ] ] # 21-P3/8

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 22 P3->P4
  - [ [ -1, 11, 17 ], 1, Bi_FPN, [ ] ] # 23
  - [ -1, 3, C2f, [ 512 ] ] # 24-P4/16

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 25 P4->P5
  - [ [ -1, 14 ], 1, Bi_FPN, [ ] ] # 26
  - [ -1, 3, C2f, [ 1024 ] ] # 27-P5/32

  - [ [ 23, 26, 29 ], 1, Detect, [ nc ] ]  # Detect(P3, P4, P5)
